airfoil_OFJ_static/mesh/rotating/system/blockMeshDict
/*-------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2.2.2                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*--------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
   object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(

	(0.0 0.5 -0.000714) //0
	(0.289392 0.5 0.07749) //1
	(0.289392 0.5 -0.073086) //2
	(0.6 0.5 -0.005346) //3
	(0.0 -0.5 -0.000714) //4
	(0.289392 -0.5 0.07749) //5
	(0.289392 -0.5 -0.073086) //6
	(0.6 -0.5 -0.005346) //7
	(0.289392 0.5 0.8) //8
	(1.1 0.5 -0.005346) //9
	(0.289392 0.5 -0.8) //10
	(-0.5 0.5 -0.000714) //11
	(0.289392 -0.5 0.8) //12
	(1.1 -0.5 -0.005346) //13
	(0.289392 -0.5 -0.8) //14
	(-0.5 -0.5 -0.000714) //15
	(-7.8 0.5 -0.000714) //16
	(0.0 0.5 7.8) //17
	(0.0 0.5 -7.8) //18
	(-7.8 -0.5 -0.000714) //19
	(0.0 -0.5 7.8) //20
	(0.0 -0.5 -7.8) //21
	(0.95053704391 0.5 0.650539433471) //22
	(0.95053704391 0.5 -0.650539433471) //23
	(0.95053704391 0.5 7.8) //24
	(0.95053704391 0.5 -7.8) //25
	(0.95053704391 -0.5 0.650539433471) //26
	(0.95053704391 -0.5 -0.650539433471) //27
	(0.95053704391 -0.5 7.8) //28
	(0.95053704391 -0.5 -7.8) //29
	(16.2 0.5 0.650539433471) //30
	(16.2 0.5 -0.650539433471) //31
	(16.2 -0.5 0.650539433471) //32
	(16.2 -0.5 -0.650539433471) //33
	(16.2 0.5 7.8) //34
	(16.2 0.5 -7.8) //35
	(16.2 -0.5 7.8) //36
	(16.2 -0.5 -7.8) //37
	(16.2 0.5 -0.005346) //38
	(16.2 -0.5 -0.005346) //39
	(0.289392 0.5 0.86) //40
	(1.16 0.5 -0.005346) //41
	(0.289392 0.5 -0.86) //42
	(-0.56 0.5 -0.000714) //43
	(0.289392 -0.5 0.86) //44
	(1.16 -0.5 -0.005346) //45
	(0.289392 -0.5 -0.86) //46
	(-0.56 -0.5 -0.000714) //47
	(0.3 0.5 0.92) //48
	(1.22 0.5 -0.005346) //49
	(0.3 0.5 -0.92) //50
	(-0.62 0.5 -0.000714) //51
	(0.3 -0.5 0.92) //52
	(1.22 -0.5 -0.005346) //53
	(0.3 -0.5 -0.92) //54
	(-0.62 -0.5 -0.000714) //55
	(0.90811071496 0.5 0.608112948679) //56
	(0.90811071496 0.5 -0.608112948679) //57
	(0.90811071496 -0.5 0.608112948679) //58
	(0.90811071496 -0.5 -0.608112948679) //59
	(0.6 0.5 0.74161984871) //60
	(0.6 0.5 0.0348661859753) //61
	(0.6 0.5 -0.032408146226) //62
	(0.6 0.5 -0.74161984871) //63
	(1.02138061432 0.5 0.345846800299) //64
	(0.7104 0.5 0.0348661859753) //65
	(0.7104 0.5 -0.005346) //66
	(0.7104 0.5 -0.032408146226) //67
	(1.02138061432 0.5 -0.345846800299) //68
	(0.6 -0.5 0.74161984871) //69
	(0.6 -0.5 0.0348661859753) //70
	(0.6 -0.5 -0.032408146226) //71
	(0.6 -0.5 -0.74161984871) //72
	(1.02138061432 -0.5 0.345846800299) //73
	(0.7104 -0.5 0.0348661859753) //74
	(0.7104 -0.5 -0.005346) //75
	(0.7104 -0.5 -0.032408146226) //76
	(1.02138061432 -0.5 -0.345846800299) //77
	(0.289392 0.5 0.104730328453) //78
	(0.289392 0.5 -0.0997364099401) //79
	(0.289392 -0.5 0.104730328453) //80
	(0.289392 -0.5 -0.0997364099401) //81
	(-0.0276 0.5 -0.000714) //82
	(-0.0276 -0.5 -0.000714) //83
	(0.6225 0.5 0.797241337363) //84
	(1.0754841604 0.5 0.371785310322) //85
	(1.0754841604 0.5 -0.371785310322) //86
	(0.6225 0.5 -0.797241337363) //87
	(0.6225 -0.5 0.797241337363) //88
	(1.0754841604 -0.5 0.371785310322) //89
	(1.0754841604 -0.5 -0.371785310322) //90
	(0.6225 -0.5 -0.797241337363) //91
	(0.6 0.5 0.005622) //92
	(0.7104 0.5 0.005622) //93
	(1.0987512321 0.5 0.0446818668022) //94
	(1.15865757451 0.5 0.0480330068124) //95
	(0.6 -0.5 0.005622) //96
	(0.7104 -0.5 0.005622) //97
	(1.0987512321 -0.5 0.0446818668022) //98
	(1.15865757451 -0.5 0.0480330068124) //99
	(1.13860490636 0.5 0.190635282749) //100
	(1.19711222541 0.5 0.203935418754) //101
	(16.2 0.5 0.203935418754) //102
	(1.13860490636 -0.5 0.190635282749) //103
	(1.19711222541 -0.5 0.203935418754) //104
	(16.2 -0.5 0.203935418754) //105

);

blocks
(

    hex (0 1 78 82 4 5 80 83) shape (180 60 1) edgeGrading (1 1 1 1 1 1 1 1 1 1 1 1)
    hex (82 78 8 11 83 80 12 15) shape (180 290 1) edgeGrading (1 0.0806369866177 0.0806369866177 1 8.63403496869 15.1957703206 15.1957703206 8.63403496869 1 1 1 1)
    hex (1 92 61 78 5 96 70 80) shape (200 60 1) edgeGrading (1 1 1 1 1 1 1 1 1 1 1 1)
    hex (78 61 60 8 80 70 69 12) shape (200 290 1) edgeGrading (1 1 1 1 15.1957703206 15.5169155935 15.5169155935 15.1957703206 1 1 1 1)
    hex (92 93 65 61 96 97 74 70) shape (121 60 1) edgeGrading (0.288208603851 0.288208603851 0.288208603851 0.288208603851 1 1 1 1 1 1 1 1)
    hex (3 66 93 92 7 75 97 96) shape (121 22 1) edgeGrading (0.288208603851 0.288208603851 0.288208603851 0.288208603851 1 1 1 1 1 1 1 1)
    hex (61 65 64 60 70 74 73 69) shape (121 290 1) edgeGrading (0.288208603851 7.30612846418 7.30612846418 0.288208603851 15.5169155935 7.75288409511 7.75288409511 15.5169155935 1 1 1 1)
    hex (93 94 64 65 97 98 73 74) shape (290 60 1) edgeGrading (6.46047101037 7.75288409511 7.75288409511 6.46047101037 1 1 1 1 1 1 1 1)
    hex (66 9 94 93 75 13 98 97) shape (290 22 1) edgeGrading (6.44231687263 6.46047101037 6.46047101037 6.44231687263 1 1 1 1 1 1 1 1)
    hex (2 0 82 79 6 4 83 81) shape (180 60 1) edgeGrading (1 1 1 1 1 1 1 1 1 1 1 1)
    hex (79 82 11 10 81 83 15 14) shape (180 290 1) edgeGrading (1 12.4012570651 12.4012570651 1 15.1957703206 8.63403496869 8.63403496869 15.1957703206 1 1 1 1)
    hex (3 2 79 62 7 6 81 71) shape (200 60 1) edgeGrading (1 1 1 1 1 1 1 1 1 1 1 1)
    hex (62 79 10 63 71 81 14 72) shape (200 290 1) edgeGrading (1 1 1 1 15.5169155935 15.1957703206 15.1957703206 15.5169155935 1 1 1 1)
    hex (66 3 62 67 75 7 71 76) shape (121 60 1) edgeGrading (3.46970904629 3.46970904629 3.46970904629 3.46970904629 1 1 1 1 1 1 1 1)
    hex (67 62 63 68 76 71 72 77) shape (121 290 1) edgeGrading (3.46970904629 0.136871395692 0.136871395692 3.46970904629 7.75288409511 15.5169155935 15.5169155935 7.75288409511 1 1 1 1)
    hex (9 66 67 68 13 75 76 77) shape (290 60 1) edgeGrading (0.155223659403 0.128984257695 0.128984257695 0.155223659403 4.23779119727 1 1 4.23779119727 1 1 1 1)
    hex (11 8 40 43 15 12 44 47) shape (180 20 1) edgeGrading (0.0806369866177 0.0806369866177 0.0806369866177 0.0806369866177 0.553956388185 0.126314665879 0.126314665879 0.553956388185 1 1 1 1)
    hex (8 60 84 40 12 69 88 44) shape (200 20 1) edgeGrading (1 1 1 1 0.126314665879 0.118338307088 0.118338307088 0.126314665879 1 1 1 1)
    hex (60 64 85 84 69 73 89 88) shape (121 20 1) edgeGrading (7.30612846418 7.30612846418 7.30612846418 7.30612846418 0.118338307088 0.701220172647 0.701220172647 0.118338307088 1 1 1 1)
    hex (94 9 41 95 98 13 45 99) shape (22 20 1) edgeGrading (1 1 1 1 1.02156954385 1.02731005447 1.02731005447 1.02156954385 1 1 1 1)
    hex (64 94 95 85 73 98 99 89) shape (60 20 1) edgeGrading (1 1 1 1 0.701220172647 1.02156954385 1.02156954385 0.701220172647 1 1 1 1)
    hex (9 68 86 41 13 77 90 45) shape (60 20 1) edgeGrading (4.23779119727 4.23779119727 4.23779119727 4.23779119727 1.02731005447 0.701220172647 0.701220172647 1.02731005447 1 1 1 1)
    hex (68 63 87 86 77 72 91 90) shape (121 20 1) edgeGrading (0.136871395692 0.136871395692 0.136871395692 0.136871395692 0.701220172647 0.118338307088 0.118338307088 0.701220172647 1 1 1 1)
    hex (63 10 42 87 72 14 46 91) shape (200 20 1) edgeGrading (1 1 1 1 0.118338307088 0.126314665879 0.126314665879 0.118338307088 1 1 1 1)
    hex (10 11 43 42 14 15 47 46) shape (180 20 1) edgeGrading (12.4012570651 12.4012570651 12.4012570651 12.4012570651 0.126314665879 0.553956388185 0.553956388185 0.126314665879 1 1 1 1)

);

edges
(

arc 11 8 (-0.265685424948 0.5 0.565685424951)
arc 8 60 (0.458935464475 0.5 0.784053262306)
arc 60 64 (0.7413570924 0.5 0.667236027945)
arc 64 94 (1.06897530452 0.5 0.220628604305)
arc 94 9 (1.09968774709 0.5 0.022349656833)
arc 9 68 (1.08405326227 0.5 -0.158935464636)
arc 68 63 (0.7413570924 0.5 -0.667236027945)
arc 63 10 (0.458935464475 0.5 -0.784053262306)
arc 10 11 (-0.265685424948 0.5 -0.565685424951)
arc 15 12 (-0.265685424948 -0.5 0.565685424951)
arc 12 69 (0.458935464475 -0.5 0.784053262306)
arc 69 73 (0.7413570924 -0.5 0.667236027945)
arc 73 98 (1.06897530452 -0.5 0.220628604305)
arc 98 13 (1.09968774709 -0.5 0.022349656833)
arc 13 77 (1.08405326227 -0.5 -0.158935464636)
arc 77 72 (0.7413570924 -0.5 -0.667236027945)
arc 72 14 (0.458935464475 -0.5 -0.784053262306)
arc 14 15 (-0.265685424948 -0.5 -0.565685424951)
arc 43 40 (-0.308111831819 0.5 0.608111831822)
arc 40 84 (0.470855624311 0.5 0.842857256979)
arc 84 85 (0.77445887433 0.5 0.717278730041)
arc 85 95 (1.12664845236 0.5 0.237175749628)
arc 95 41 (1.15966432812 0.5 0.0240258810954)
arc 41 86 (1.14285725694 0.5 -0.170855624484)
arc 86 87 (0.77445887433 0.5 -0.717278730041)
arc 87 42 (0.470855624311 0.5 -0.842857256979)
arc 42 43 (-0.308111831819 0.5 -0.608111831822)
arc 47 44 (-0.308111831819 -0.5 0.608111831822)
arc 44 88 (0.470855624311 -0.5 0.842857256979)
arc 88 89 (0.77445887433 -0.5 0.717278730041)
arc 89 99 (1.12664845236 -0.5 0.237175749628)
arc 99 45 (1.15966432812 -0.5 0.0240258810954)
arc 45 90 (1.14285725694 -0.5 -0.170855624484)
arc 90 91 (0.77445887433 -0.5 -0.717278730041)
arc 91 46 (0.470855624311 -0.5 -0.842857256979)
arc 46 47 (-0.308111831819 -0.5 -0.608111831822)
spline 0 1
	(
        (6e-06 0.500000 -0.000714)
        (0.000762 0.500000 0.007956)
        (0.003024 0.500000 0.016002)
        (0.006786 0.500000 0.024006)
        (0.012024 0.500000 0.032034)
        (0.018714 0.500000 0.03993)
        (0.026826 0.500000 0.047628)
        (0.036318 0.500000 0.055002)
        (0.047154 0.500000 0.061938)
        (0.059268 0.500000 0.06831)
        (0.072612 0.500000 0.073992)
        (0.087114 0.500000 0.078876)
        (0.102714 0.500000 0.082884)
        (0.119334 0.500000 0.08595)
        (0.136884 0.500000 0.088038)
        (0.155298 0.500000 0.089196)
        (0.174474 0.500000 0.089448)
        (0.194322 0.500000 0.088842)
        (0.214752 0.500000 0.087468)
        (0.235662 0.500000 0.08538)
        (0.25695 0.500000 0.082656)
        (0.27852 0.500000 0.079374)
	)
spline 1 92
	(
        (0.300264 0.500000 0.075606)
        (0.32208 0.500000 0.071454)
        (0.34386 0.500000 0.067014)
        (0.365502 0.500000 0.062346)
        (0.386904 0.500000 0.057522)
        (0.407958 0.500000 0.052596)
        (0.428568 0.500000 0.047634)
        (0.448632 0.500000 0.042696)
        (0.468054 0.500000 0.037854)
        (0.486744 0.500000 0.033168)
        (0.504606 0.500000 0.02868)
        (0.521562 0.500000 0.024444)
        (0.537528 0.500000 0.020502)
        (0.552426 0.500000 0.016872)
        (0.566184 0.500000 0.013596)
        (0.578742 0.500000 0.01065)
        (0.590028 0.500000 0.007998)
	)
spline 0 2
	(
        (6e-06 0.500000 -0.000714)
        (0.000762 0.500000 -0.007536)
        (0.003024 0.500000 -0.015012)
        (0.006786 0.500000 -0.022584)
        (0.012024 0.500000 -0.03021)
        (0.018714 0.500000 -0.037872)
        (0.026826 0.500000 -0.045492)
        (0.036318 0.500000 -0.05295)
        (0.047154 0.500000 -0.060108)
        (0.059268 0.500000 -0.066816)
        (0.072612 0.500000 -0.07293)
        (0.087114 0.500000 -0.078312)
        (0.102714 0.500000 -0.08286)
        (0.119334 0.500000 -0.086466)
        (0.136884 0.500000 -0.089082)
        (0.155298 0.500000 -0.090648)
        (0.174474 0.500000 -0.091128)
        (0.194322 0.500000 -0.09048)
        (0.214752 0.500000 -0.08868)
        (0.235662 0.500000 -0.085698)
        (0.25695 0.500000 -0.081546)
        (0.27852 0.500000 -0.07626)
	)
spline 2 3
	(
        (0.300264 0.500000 -0.069912)
        (0.32208 0.500000 -0.062652)
        (0.34386 0.500000 -0.054696)
        (0.365502 0.500000 -0.046332)
        (0.386904 0.500000 -0.037908)
        (0.407958 0.500000 -0.029796)
        (0.428568 0.500000 -0.022332)
        (0.448632 0.500000 -0.015786)
        (0.468054 0.500000 -0.01029)
        (0.486744 0.500000 -0.006012)
        (0.504606 0.500000 -0.002874)
        (0.521562 0.500000 -0.000804)
        (0.537528 0.500000 0.00024)
        (0.552426 0.500000 0.000348)
        (0.566184 0.500000 -0.000306)
        (0.578742 0.500000 -0.001566)
        (0.590028 0.500000 -0.003348)
	)
spline 4 5
	(
        (6e-06 -0.500000 -0.000714)
        (0.000762 -0.500000 0.007956)
        (0.003024 -0.500000 0.016002)
        (0.006786 -0.500000 0.024006)
        (0.012024 -0.500000 0.032034)
        (0.018714 -0.500000 0.03993)
        (0.026826 -0.500000 0.047628)
        (0.036318 -0.500000 0.055002)
        (0.047154 -0.500000 0.061938)
        (0.059268 -0.500000 0.06831)
        (0.072612 -0.500000 0.073992)
        (0.087114 -0.500000 0.078876)
        (0.102714 -0.500000 0.082884)
        (0.119334 -0.500000 0.08595)
        (0.136884 -0.500000 0.088038)
        (0.155298 -0.500000 0.089196)
        (0.174474 -0.500000 0.089448)
        (0.194322 -0.500000 0.088842)
        (0.214752 -0.500000 0.087468)
        (0.235662 -0.500000 0.08538)
        (0.25695 -0.500000 0.082656)
        (0.27852 -0.500000 0.079374)
	)
spline 5 96
	(
        (0.300264 -0.500000 0.075606)
        (0.32208 -0.500000 0.071454)
        (0.34386 -0.500000 0.067014)
        (0.365502 -0.500000 0.062346)
        (0.386904 -0.500000 0.057522)
        (0.407958 -0.500000 0.052596)
        (0.428568 -0.500000 0.047634)
        (0.448632 -0.500000 0.042696)
        (0.468054 -0.500000 0.037854)
        (0.486744 -0.500000 0.033168)
        (0.504606 -0.500000 0.02868)
        (0.521562 -0.500000 0.024444)
        (0.537528 -0.500000 0.020502)
        (0.552426 -0.500000 0.016872)
        (0.566184 -0.500000 0.013596)
        (0.578742 -0.500000 0.01065)
        (0.590028 -0.500000 0.007998)
	)
spline 4 6
	(
        (6e-06 -0.500000 -0.000714)
        (0.000762 -0.500000 -0.007536)
        (0.003024 -0.500000 -0.015012)
        (0.006786 -0.500000 -0.022584)
        (0.012024 -0.500000 -0.03021)
        (0.018714 -0.500000 -0.037872)
        (0.026826 -0.500000 -0.045492)
        (0.036318 -0.500000 -0.05295)
        (0.047154 -0.500000 -0.060108)
        (0.059268 -0.500000 -0.066816)
        (0.072612 -0.500000 -0.07293)
        (0.087114 -0.500000 -0.078312)
        (0.102714 -0.500000 -0.08286)
        (0.119334 -0.500000 -0.086466)
        (0.136884 -0.500000 -0.089082)
        (0.155298 -0.500000 -0.090648)
        (0.174474 -0.500000 -0.091128)
        (0.194322 -0.500000 -0.09048)
        (0.214752 -0.500000 -0.08868)
        (0.235662 -0.500000 -0.085698)
        (0.25695 -0.500000 -0.081546)
        (0.27852 -0.500000 -0.07626)
	)
spline 6 7
	(
        (0.300264 -0.500000 -0.069912)
        (0.32208 -0.500000 -0.062652)
        (0.34386 -0.500000 -0.054696)
        (0.365502 -0.500000 -0.046332)
        (0.386904 -0.500000 -0.037908)
        (0.407958 -0.500000 -0.029796)
        (0.428568 -0.500000 -0.022332)
        (0.448632 -0.500000 -0.015786)
        (0.468054 -0.500000 -0.01029)
        (0.486744 -0.500000 -0.006012)
        (0.504606 -0.500000 -0.002874)
        (0.521562 -0.500000 -0.000804)
        (0.537528 -0.500000 0.00024)
        (0.552426 -0.500000 0.000348)
        (0.566184 -0.500000 -0.000306)
        (0.578742 -0.500000 -0.001566)
        (0.590028 -0.500000 -0.003348)
	)
spline 82 78
	(
        (-0.0275930255441 0.500000 -0.000482075409935)
        (-0.0267336682477 0.500000 0.0103535461643)
        (-0.0235459726785 0.500000 0.0234717089543)
        (-0.0181925099995 0.500000 0.0357462741964)
        (-0.0110909588442 0.500000 0.0471157332436)
        (-0.00234392497593 0.500000 0.0577716309711)
        (0.0078274144489 0.500000 0.0676483333403)
        (0.0193856414276 0.500000 0.0767977618168)
        (0.0322746570135 0.500000 0.0851837555758)
        (0.0464193824894 0.500000 0.0927368914941)
        (0.0617991127327 0.500000 0.0993857289295)
        (0.0783049915123 0.500000 0.105032478537)
        (0.0958459781946 0.500000 0.109615821421)
        (0.114326934082 0.500000 0.113092020759)
        (0.133623304016 0.500000 0.115444711983)
        (0.153565742588 0.500000 0.116741585568)
        (0.174111327941 0.500000 0.117045617089)
        (0.195164291904 0.500000 0.116429144549)
        (0.216604027726 0.500000 0.115005792092)
        (0.238404401403 0.500000 0.112843416294)
        (0.260453116932 0.500000 0.110032781618)
        (0.282671715327 0.500000 0.106659953526)
	)
spline 78 61
	(
        (0.304976547942 0.500000 0.102800703379)
        (0.327240182217 0.500000 0.0985673273408)
        (0.349373057682 0.500000 0.0940577829268)
        (0.371321265422 0.500000 0.0893255505882)
        (0.392972774081 0.500000 0.084446523787)
        (0.414245757435 0.500000 0.0794702275505)
        (0.43502829616 0.500000 0.0744672736267)
        (0.455227879407 0.500000 0.0694962681861)
        (0.474730462133 0.500000 0.0646343071937)
        (0.493456181494 0.500000 0.0599393768713)
        (0.511331713599 0.500000 0.0554479804354)
        (0.528251524224 0.500000 0.0512210473663)
        (0.544143766767 0.500000 0.0472973658322)
        (0.558959775008 0.500000 0.0436874765788)
        (0.572577254228 0.500000 0.040445325883)
        (0.58504559481 0.500000 0.0375205171604)
        (0.59634152377 0.500000 0.0348661859753)
	)
spline 82 79
	(
        (-0.0275930255441 0.500000 -0.000945924590065)
        (-0.0266700726107 0.500000 -0.0105759658359)
        (-0.0233932591794 0.500000 -0.0230050230482)
        (-0.0179314484012 0.500000 -0.0348643804719)
        (-0.01072634445 0.500000 -0.0458363184214)
        (-0.00207626729342 0.500000 -0.0560248175738)
        (0.0079294363047 0.500000 -0.0656086567926)
        (0.0192661251711 0.500000 -0.074652386155)
        (0.0319415186698 0.500000 -0.0831371209511)
        (0.045897775951 0.500000 -0.0909613330662)
        (0.0611154379495 0.500000 -0.0980216133602)
        (0.0775110407562 0.500000 -0.104187532338)
        (0.0949891307716 0.500000 -0.109356912941)
        (0.113481857265 0.500000 -0.113438438255)
        (0.132814905636 0.500000 -0.116380396859)
        (0.152959228252 0.500000 -0.118148729931)
        (0.17378335276 0.500000 -0.118719357458)
        (0.195222608425 0.500000 -0.118065302327)
        (0.217174334413 0.500000 -0.116173495522)
        (0.239558643448 0.500000 -0.11302154607)
        (0.262233533187 0.500000 -0.108635560297)
        (0.285089340296 0.500000 -0.103066785859)
	)
spline 79 62
	(
        (0.307998737311 0.500000 -0.0964060340214)
        (0.330794920932 0.500000 -0.0888399772633)
        (0.353329944505 0.500000 -0.0806205086951)
        (0.37545141949 0.500000 -0.0720763013465)
        (0.397012710384 0.500000 -0.0635901723063)
        (0.417881067443 0.500000 -0.0555504701462)
        (0.437966131574 0.500000 -0.0482826285651)
        (0.457192577202 0.500000 -0.0420248360634)
        (0.475569096833 0.500000 -0.0368471707753)
        (0.492902172395 0.500000 -0.0329162173787)
        (0.50938163743 0.500000 -0.0300576952443)
        (0.524906595523 0.500000 -0.0282005998034)
        (0.53932888913 0.500000 -0.0273011836772)
        (0.552626075296 0.500000 -0.0272512748071)
        (0.564873486811 0.500000 -0.0278748693127)
        (0.575986603794 0.500000 -0.0290281155731)
        (0.585723432978 0.500000 -0.030610257844)
        (0.594577801033 0.500000 -0.032408146226)
	)
spline 83 80
	(
        (-0.0275930255441 -0.500000 -0.000482075409935)
        (-0.0267336682477 -0.500000 0.0103535461643)
        (-0.0235459726785 -0.500000 0.0234717089543)
        (-0.0181925099995 -0.500000 0.0357462741964)
        (-0.0110909588442 -0.500000 0.0471157332436)
        (-0.00234392497593 -0.500000 0.0577716309711)
        (0.0078274144489 -0.500000 0.0676483333403)
        (0.0193856414276 -0.500000 0.0767977618168)
        (0.0322746570135 -0.500000 0.0851837555758)
        (0.0464193824894 -0.500000 0.0927368914941)
        (0.0617991127327 -0.500000 0.0993857289295)
        (0.0783049915123 -0.500000 0.105032478537)
        (0.0958459781946 -0.500000 0.109615821421)
        (0.114326934082 -0.500000 0.113092020759)
        (0.133623304016 -0.500000 0.115444711983)
        (0.153565742588 -0.500000 0.116741585568)
        (0.174111327941 -0.500000 0.117045617089)
        (0.195164291904 -0.500000 0.116429144549)
        (0.216604027726 -0.500000 0.115005792092)
        (0.238404401403 -0.500000 0.112843416294)
        (0.260453116932 -0.500000 0.110032781618)
        (0.282671715327 -0.500000 0.106659953526)
	)
spline 80 70
	(
        (0.304976547942 -0.500000 0.102800703379)
        (0.327240182217 -0.500000 0.0985673273408)
        (0.349373057682 -0.500000 0.0940577829268)
        (0.371321265422 -0.500000 0.0893255505882)
        (0.392972774081 -0.500000 0.084446523787)
        (0.414245757435 -0.500000 0.0794702275505)
        (0.43502829616 -0.500000 0.0744672736267)
        (0.455227879407 -0.500000 0.0694962681861)
        (0.474730462133 -0.500000 0.0646343071937)
        (0.493456181494 -0.500000 0.0599393768713)
        (0.511331713599 -0.500000 0.0554479804354)
        (0.528251524224 -0.500000 0.0512210473663)
        (0.544143766767 -0.500000 0.0472973658322)
        (0.558959775008 -0.500000 0.0436874765788)
        (0.572577254228 -0.500000 0.040445325883)
        (0.58504559481 -0.500000 0.0375205171604)
        (0.59634152377 -0.500000 0.0348661859753)
	)
spline 83 81
	(
        (-0.0275930255441 -0.500000 -0.000945924590065)
        (-0.0266700726107 -0.500000 -0.0105759658359)
        (-0.0233932591794 -0.500000 -0.0230050230482)
        (-0.0179314484012 -0.500000 -0.0348643804719)
        (-0.01072634445 -0.500000 -0.0458363184214)
        (-0.00207626729342 -0.500000 -0.0560248175738)
        (0.0079294363047 -0.500000 -0.0656086567926)
        (0.0192661251711 -0.500000 -0.074652386155)
        (0.0319415186698 -0.500000 -0.0831371209511)
        (0.045897775951 -0.500000 -0.0909613330662)
        (0.0611154379495 -0.500000 -0.0980216133602)
        (0.0775110407562 -0.500000 -0.104187532338)
        (0.0949891307716 -0.500000 -0.109356912941)
        (0.113481857265 -0.500000 -0.113438438255)
        (0.132814905636 -0.500000 -0.116380396859)
        (0.152959228252 -0.500000 -0.118148729931)
        (0.17378335276 -0.500000 -0.118719357458)
        (0.195222608425 -0.500000 -0.118065302327)
        (0.217174334413 -0.500000 -0.116173495522)
        (0.239558643448 -0.500000 -0.11302154607)
        (0.262233533187 -0.500000 -0.108635560297)
        (0.285089340296 -0.500000 -0.103066785859)
	)
spline 81 71
	(
        (0.307998737311 -0.500000 -0.0964060340214)
        (0.330794920932 -0.500000 -0.0888399772633)
        (0.353329944505 -0.500000 -0.0806205086951)
        (0.37545141949 -0.500000 -0.0720763013465)
        (0.397012710384 -0.500000 -0.0635901723063)
        (0.417881067443 -0.500000 -0.0555504701462)
        (0.437966131574 -0.500000 -0.0482826285651)
        (0.457192577202 -0.500000 -0.0420248360634)
        (0.475569096833 -0.500000 -0.0368471707753)
        (0.492902172395 -0.500000 -0.0329162173787)
        (0.50938163743 -0.500000 -0.0300576952443)
        (0.524906595523 -0.500000 -0.0282005998034)
        (0.53932888913 -0.500000 -0.0273011836772)
        (0.552626075296 -0.500000 -0.0272512748071)
        (0.564873486811 -0.500000 -0.0278748693127)
        (0.575986603794 -0.500000 -0.0290281155731)
        (0.585723432978 -0.500000 -0.030610257844)
        (0.594577801033 -0.500000 -0.032408146226)
	)

);

boundary
(

	shape
	{
		type wall;
		faces
		(
		(4 0 1 5)
		(5 1 92 96)
		(7 3 92 96)
	        (0 4 6 2)
	        (2 6 7 3)
		);
	}

	rotbox_slave
	{
		type patch;
		faces
		(
	        (40 43 47 44)
	        (84 40 44 88)
	        (85 84 88 89)
	        (41 95 99 45)
	        (95 85 89 99)
	        (86 41 45 90)
	        (87 86 90 91)
	        (42 87 91 46)
	        (43 42 46 47)
		);
	}

	front
	{
		type empty;
		faces
		(
		(43 11 8 40)
		(11 82 78 8)
		(82 0 1 78)
		(82 79 2 0)
		(11 10 79 82)
		(43 42 10 11)
		(1 92 61 78)
		(78 61 60 8)
		(8 60 84 40)
		(3 66 93 92)
		(92 93 65 61)
		(61 65 64 60)
		(66 9 94 93)
		(93 94 64 65)
		(60 64 85 84)
		(9 41 95 94)
		(94 95 85 64)
		(79 62 3 2)
		(10 63 62 79)
		(42 87 63 10)
		(87 86 68 63)
		(63 68 67 62)
		(62 67 66 3)
		(67 68 9 66)
		(68 86 41 9) 
		);
	}

	back
	{
		type empty;
		faces
		(
		(15 47 44 12)
		(83 15 12 80)
		(4 83 80 5)
		(46 47 15 14)
		(15 14 81 83)
		(83 81 6 4)
		(12 69 88 44)
		(80 70 69 12)
		(5 96 70 80)
		(81 71 7 6)
		(14 72 71 81)
		(46 91 72 14)
		(69 73 89 88)
		(70 74 73 69)
		(7 75 97 96)
		(96 97 74 70)
		(71 76 75 7)
		(72 77 76 71)
		(91 90 77 72)
		(75 13 98 97)
		(97 98 73 74)
		(13 45 99 98)
		(98 99 89 73)
		(76 77 13 75)
		(77 90 45 13)
		);
	}

);

mergePatchPairs
(


);

// ************************************************************************* //
